[command]/home/runner/work/_temp/349fdbef-2700-497e-a0d8-2fb9001d9650/terraform-bin plan -out=plan.tfplan -no-color

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.test_deploy_bucket will be created
  + resource "aws_s3_bucket" "test_deploy_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "test-deploy-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.test_deploy_bucket,
  on main.tf line 1, in resource "aws_s3_bucket" "test_deploy_bucket":
   1: resource "aws_s3_bucket" "test_deploy_bucket" {

Use the aws_s3_bucket_versioning resource instead

(and 5 more similar warnings elsewhere)

Warning: Version constraints inside provider configuration blocks are deprecated

  on providers.tf line 2, in provider "aws":
   2:   version = "~> 5.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_s3_bucket.test_deploy_bucket will be created%0A  + resource "aws_s3_bucket" "test_deploy_bucket" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = "private"%0A      + arn                         = (known after apply)%0A      + bucket                      = "test-deploy-bucket"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags_all                    = (known after apply)%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A%0A      + server_side_encryption_configuration {%0A          + rule {%0A              + apply_server_side_encryption_by_default {%0A                  + sse_algorithm = "AES256"%0A                }%0A            }%0A        }%0A%0A      + versioning {%0A          + enabled    = true%0A          + mfa_delete = false%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A%0AWarning: Argument is deprecated%0A%0A  with aws_s3_bucket.test_deploy_bucket,%0A  on main.tf line 1, in resource "aws_s3_bucket" "test_deploy_bucket":%0A   1: resource "aws_s3_bucket" "test_deploy_bucket" {%0A%0AUse the aws_s3_bucket_versioning resource instead%0A%0A(and 5 more similar warnings elsewhere)%0A%0AWarning: Version constraints inside provider configuration blocks are deprecated%0A%0A  on providers.tf line 2, in provider "aws":%0A   2:   version = "~> 5.0"%0A%0ATerraform 0.13 and earlier allowed provider version constraints inside the%0Aprovider configuration block, but that is now deprecated and will be removed%0Ain a future version of Terraform. To silence this warning, move the provider%0Aversion constraint into the required_providers block.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: plan.tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "plan.tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0
